app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `uname` = 'abcd'
---
    public function login(){

        helper('form');
        $validation = \Config\Services::validation();
        $validation->setRules([
            'uname' => 'required',
            'pass' => 'required|alpha_numeric_punct|min_length[5]|max_length[16]',
        ]);
        if (!$this->validate($validation->getRules())) {
            return view('user/login', ['validation' => $this->validator]);
        }
        $user = new Users();
        $uname = $this->request->getPost('uname');
        $password = $this->request->getPost('pass');
        $data = $user->where('uname', $uname)->find();